БИТУправление_медицинским_центром_демо/src/Catalogs/ШаблоныЭтикетокИЦенниковБПО/ШаблоныЭтикетокИЦенниковБПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЭтикетокИЦенниковБПО</name>
  <predefined>
    <items>
      <name>ЭтикеткаГемотест</name>
      <description>Этикетка гемотест</description>
    </items>
    <items>
      <name>ЭтикеткаКДЛ</name>
      <description>Этикетка КДЛ</description>
    </items>
    <items>
      <name>ЭтикеткаСитилаб</name>
      <description>Этикетка ситилаб</description>
    </items>
    <items>
      <name>ЭтикеткаХеликс</name>
      <description>Этикетка хеликс</description>
    </items>
  </predefined>
  <attributes>
    <name>XMLОписаниеМакета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ШаблоныЭтикетокИЦенниковБПО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - имя объекта, для которого вызывается заполнение.
//  Настройки - Структура:
//    * ПриНачальномЗаполненииЭлемента - Булево - если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//    * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(ПолноеИмяОбъекта, Настройки) Экспорт
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
КонецПроцедуры

// Процедура заполняет предопределенные элементы в справочнике Шаблоны этикеток и ценников.
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	ОписанияМакетов = ОписанияМакетов();
	
	НачатьТранзакцию();
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ШаблоныЭтикетокИЦенниковБПО.Ссылка КАК Ссылка,
			|	ШаблоныЭтикетокИЦенниковБПО.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
			|ИЗ
			|	Справочник.ШаблоныЭтикетокИЦенниковБПО КАК ШаблоныЭтикетокИЦенниковБПО
			|ГДЕ
			|	ШаблоныЭтикетокИЦенниковБПО.Предопределенный
			|	И (ВЫРАЗИТЬ(ШаблоныЭтикетокИЦенниковБПО.XMLОписаниеМакета КАК СТРОКА(1))) = """"";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ШаблоныЭтикетокИЦенниковБПО");
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ШаблоныЭтикетокИЦенниковБПО
			ШаблонОбъект.XMLОписаниеМакета = ОписанияМакетов[Выборка.ИмяПредопределенныхДанных];
			//+бит
			ОпределитьПоляШаблона(ОписанияМакетов[Выборка.ИмяПредопределенныхДанных], ШаблонОбъект);
			//-бит
			ШаблонОбъект.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		МенеджерОборудования.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("ru = 'Заполнение предопределенных элементов'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ОписанияМакетов()
	
	ОписанияМакетов = Новый Соответствие();
	Макет = Справочники.ШаблоныЭтикетокИЦенниковБПО.ПолучитьМакет("ШаблоныЭтикеток");
	
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		ИмяПредопределенного = Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		XMLОписаниеМакета = Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
		
		Если Не ПустаяСтрока(ИмяПредопределенного) = "" Тогда
			ОписанияМакетов.Вставить(ИмяПредопределенного, XMLОписаниеМакета);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОписанияМакетов;
	
КонецФункции

Процедура ОпределитьПоляШаблона(Источник, Объект)
	
	СообщениеОбОшибке = "";
	СодержимоеXMLФайла = Неопределено;
	
	Если ОборудованиеПринтерыЭтикетокВызовСервера.ПолучитьОписаниеМакета(Источник, СообщениеОбОшибке, СодержимоеXMLФайла) Тогда
		
		Объект.Поля.Очистить();
		
		Для Каждого ТекПоле Из СодержимоеXMLФайла.Поля Цикл
			НовоеПоле = Объект.Поля.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПоле, ТекПоле);
		КонецЦикла;
		
	Иначе
		//ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
